# 1. Tensorflow
#   머신 러닝과 딥 러닝을 직관적이고 손쉽게 할 수 있도록 설계되었습니다.
# 2. Keras
#   딥 러닝 프레임워크인 텐서플로우에 대한 추상화 된 API를 제공합니다.
#   케라스는 백엔드로 텐서플로우를 사용하며, 좀 더 쉽게 딥 러닝을 사용할 수 있게 해줍니다.
# 3. Gensim
#   머신 러닝을 사용하여 토픽 모델링과 자연어 처리 등을 수행할 수 있게 해주는 오픈 소스 라이브러리입니다.
# 4. Scikit-learn
#   파이썬 머신 러닝 라이브러리이다. 사이킷런을 통해 나이브 베이즈 분류,
#   서포트 벡터 머신등 다양한 머신 러닝 모듈을 불러올 수 있다. 또한 사이킷런에는 머신 러닝을 연습
#   하기 위한 아이리스 데이터, 당뇨병 데이터 등 자체 데이터 또한 제공한다.
# 5. NLTK
#   자연어 처리를 위한 파이썬 패키지 이다.
#   import nltk + nltk.download() 코드로 NLTK의 다양한 데이터를 추가적으로 설치할 수 있다.
# 6. KoNLPy
#   한국어 자연어 처리를 위한 형태소 분석기 패키지이다.