# 데이터 사이언스 또는 머신러닝 과정에서 거치는 전반적인 과정을 알아보자.
#
# * 머신 러닝 워크플로우
# 데이터를 수집하고 머신 러닝을 하는 과정을 크게 나누면 6가지이다.
#
# 1. 수집
#   머신 러닝을 하기 위해서는 기계에 학습시켜야 할 데이터가 필요하다.
#   자연어 처리의 경우, 자연어 데이터를 말뭉치 또는 코퍼스(Corpus)라고 부르는데
#   코퍼스는 텍스트의 집합이라고 이해하면 좋다.
#
# 2. 점검 및 탐색
#   데이터가 수집되면, 이제 데이터를 점검하고 탐색을 하는 과정이 필요하다.
#   데이터의 구조, 노이즈 데이터, 머신 러닝 적용을 위해서 데이터를 어떻게
#   정제해야하는지 등을 파악해야 한다. 이를 탐색적 데이터 분석단계 라고도 한다.
#   이는 독립 변수, 종속 변수, 변수 유형, 변수의 데이터 타입 등을 점검하며
#   데이터의 특징과 내재하느 ㄴ구조적 관계를 알아내는 과정을 의미한다.
#   이 과정에서 시각화와 간단한 통계 테스트를 진행하기도 한다.
#
# 3. 전처리 및 정제
#   데이터에 대한 파악이 끝났으면, 머신 러닝 워크플로우에서 가장 까다로운 작업 중
#   하나인 데이터 전처리 과정에 들어간다. 이 단계는 많은 단계를 포함하고 있는데,
#   자연어 처리라면 토큰화, 정제, 정규화, 불용어 제거 등의 단계를 포함한다.
#   정말 까다로운 전처리의 경우에는 전처리 과정에서 머신러닝을 사용하기도 한다.
#
# 4. 모델링 및 훈련
#   데이터 전처리가 끝났다면, 머신 러닝에 대한 코드를 작성하는 단계인 모델링 단계에 들어갑니다.
#   적절한 머신 러닝 알고리즘을 선택하여 모델링이 끝났다면, 전처리가 완료 된 데이터를 머신 러닝
#   알고리즘을 통해 기계에게 학습(training)시킵니다. 이를 훈련이라고도 하는데, 이 두 용어를
#   혼용해서 사용합니다. 기계가 데이터에 대한 학습을 마치고나서 훈련이 제대로 되었다면 그 후에
#   기계는 우리가 원하는 태스크(task)인 기계 번역, 음성 인식, 텍스트 분류 등의 자연어 처리 작업을
#   수행할 수 있게 됩니다.
#   여기서 주의해야 할 점은 대부분의 경우에서 모든 데이터를 기계에게 학습시켜서는 안 된다는 점입니다.
#   뒤의 실습에서 보게되겠지만 데이터 중 일부는 테스트용으로 남겨두고 훈련용 데이터만
#   훈련에 사용해야 합니다. 그래야만 기계가 학습을 하고나서, 테스트용 데이터를 통해서 현재
#   성능이 얼마나 되는지를 측정할 수 있으며 과적합(overfitting) 상황을 막을 수 있습니다.
#
# 5. 평가
#   기계가 다 학습이 되었다면 테스트용 데이터로 성능을 평가하게 됩니다.
#   평가 방법은 기계가 예측한 데이터가 테스트용 데이터의 실제 정답과
#   얼마나 가까운지를 측정합니다.
# 6. 배포
#   평가 단계에서 기계가 성공적으로 훈련이 된 것으로 판단된다면 완성된 모델이
#   배포되는 단계가 됩니다. 다만, 여기서 완성된 모델에 대한 전체적인 피드백으로
#   인해 모델을 업데이트 해야하는 상황이 온다면 수집 단계로 돌아갈 수 있습니다.